{"podcast_details": {"podcast_title": "Building The Blockchain: Unleashing the Power of Blockchain - One Episode at a Time!", "episode_title": "Live from CES The Changing Metaverse Landscape: How to use this current shifting landscape as an opportunity. How are savvy executives and entrepreneurs are using crypto in this moment to build!", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded/1038027/1038027-1547473899908-e8fb56451b378.jpg", "episode_transcript": " Music So, Jen Collins, which is an NFT project, I think you commonly call it best. She's also a vocal advocate for those for community protections and equality, and NFT is stripped down to three. We got Zach Brush, he's the co-writer and CEO of Re-<|pt|><|translate|> Sorry. The premier platform for powering innovative multi-chain technology experiences for brand experience and maintenance. Justin Hopper, he's the CEO of the Underbridge and Brain Group. One of the world's largest medical spray holders, operators, monetizers, and he has worked with private 21, Barbie, and we see the voice of very big brands. And last, and never least, we've got Dave Tree. He's the Accenture's web-first continual business group, which includes blockchain and multi-party systems businesses, which he actually launched along with Accenture's extended reality business back in 2015. So that's the group, it's going to be fun. And we're going to start off with maybe the hardest question of the ball, which I've not been talking about before, but I think I'm a little bit about. Oh my God, what are you guys saying? That actually, yeah, I'm not sure if you guys are aware of this, but I think it's a very interesting question. So, I'm going to start off with Dave Tree. He's the CEO of Accenture, and he's the CEO of the Underbridge and Brain Group. He's the CEO of the Underbridge and Brain Group. He's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. And he's the CEO of the Underbridge and Brain Group. Thank you everyone. The metaverse sounds OMG, but I am just glad to be IRL with YOU. Thank you for joining us for another incredible week at C-Space. The next session will not be in 20 minutes, but it will be in 2024. Right here in beautiful Las Vegas, here in the Aria. On behalf of the Consumer Technology Association, thank you and enjoy the rest of your CES experience."}, "podcast_summary": "The podcast transcript includes introductions of the participants and some closing remarks about a technology conference called CES. The main focus of the podcast is not clear from the transcript.", "podcast_guest": " Jen Collins", "podcast_highlights": "From the given podcast transcript, it is difficult to extract key moments or insights as the transcript seems to be a mixture of introductions and concluding remarks. Can you provide a specific portion of the podcast for me to analyze?"}